# Use Case Queries
This notebook runs the queries necessary to show adequate cleaning and support of our use case. 

### Use Case
Which establishments, in D, have the most food inspection violations?

In [1]:
import sqlite3
import pandas as pd
db = sqlite3.connect('../data/food_inspections.db')
cur = db.cursor()

In [2]:
# 
Q = '''
SELECT est.estName, COUNT(inspec.number) AS amount_of_violations
  FROM (select * FROM Inspections) AS inspec
  INNER JOIN EstablishmentInspections AS ei
  ON inspec.inspecID = ei.inspecID
  INNER JOIN Establishments AS est
  ON est.estID = ei.estID
  GROUP BY est.estID
  ORDER BY amount_of_violations DESC
'''
cur.execute(Q)
df = pd.read_sql_query(Q, db)
df.head(10)

                       estName  amount_of_violations
0       HOST INTERNATIONAL INC                   581
1                   MCDONALD'S                   375
2             LEVY RESTAURANTS                   340
3  ILLINOIS SPORT SERVICE INC.                   337
4                    STARBUCKS                   293
5         TAQUERIA EL RANCHITO                   288
6     ST. REST COUNTRY KITCHEN                   278
7                       MACY'S                   276
8                    JIMMY G'S                   259
9     GHAREEB NAWAZ RESTAURANT                   257

In [3]:
# Query Sorted by Name of the Restaurant
Q = '''
SELECT est.estName, COUNT(inspec.number) AS amount_of_violations
  FROM (select * FROM Inspections) AS inspec
  INNER JOIN EstablishmentInspections AS ei
  ON inspec.inspecID = ei.inspecID
  INNER JOIN Establishments AS est
  ON est.estID = ei.estID
  GROUP BY est.estName
  ORDER BY amount_of_violations DESC
'''
cur.execute(Q)
df = pd.read_sql_query(Q, db)
df.head(10)

                   estName  amount_of_violations
0                   SUBWAY                  8850
1               MCDONALD'S                  6580
2           DUNKIN' DONUTS                  6437
3                 7-ELEVEN                  3864
4         JEWEL FOOD STORE                  2934
5                STARBUCKS                  2517
6              BURGER KING                  2185
7   HAROLD'S CHICKEN SHACK                  2172
8                 POPEYE'S                  1956
9  POTBELLY SANDWICH WORKS                  1838

In [4]:
db.close()